import { CategoryType } from 'features/category/type';
import { PostType } from 'features/post/type';

// 데이터를 가져오지 않고 테스트용으로 객체 생성
export const categorys: CategoryType[] = [
  { id: 1, name: '스프링', postCnt: 5 },
  { id: 2, name: '데이터', postCnt: 2 },
  { id: 3, name: '자바', postCnt: 2 },
  { id: 4, name: '알고리즘', postCnt: 5 },
];

// 데이터를 가져오지 않고 테스트용으로 객체 생성
export const posts: PostType[] = [
  {
    id: 1,
    title: '스프링이란 무엇인가??',
    content:
      '없는 피어나는 속에 능히 봄날의 원대하고, 우리의 커다란 끓는 사막이다. 든 얼음 것은 충분히 싹이 약동하다. 품에 꽃 거친 무엇이 있는 반짝이는 두손을 얼마나 뿐이다. 군영과 보는 새 위하여서, 위하여, 유소년에게서 힘있다. 그림자는 무엇이 꾸며 맺어, 얼마나 청춘 약동하다. 위하여 길지 새 남는 구하기 없는 있다. 있는 청춘의 뜨거운지라, 철환하였는가? 끓는 작고 뜨고, 붙잡아 바이며, 있으랴? 인생을 어디 인간의 석가는 이상 어디 철환하였는가?우리 지혜는 얼마나 청춘을 하는 내는 없으면, 싹이 그리하였는가? 이는 트고, 황금시대를 보이는 봄바람이다. 위하여, 살았으며, 낙원을 이것을 아니다. 풍부하게 뜨거운지라, 거친 이상의 관현악이며, 힘있다. 끓는 하는 옷을 많이 피고 그들은 구하지 이는 용기가 그리하였는가? 청춘 방황하여도, 소담스러운 낙원을 철환하였는가? 청춘의 눈에 우리 바이며, 소담스러운 새가 아름다우냐? 길을 가슴이 살 관현악이며, 이 않는 피부가 인도하겠다는 사막이다. 그들은 튼튼하며, 보이는 같이 예수는 들어 때문이다.   아니한 하는 보배를 하여도 두손을 이것을 아니다. 웅대한 착목한는 이는 무엇을 이상은 생생하며, 바로 듣는다. 따뜻한 피고 꽃이 무엇을 커다란 소담스러운 구하기 때문이다. 청춘의 살 얼마나 가치를 낙원을 영락과 있으랴? 피고 열락의 피가 있다. 맺어, 곳으로 방지하는 끓는 듣는다. 황금시대의 피어나는 그들은 않는 물방아 하는 보라. 살았으며, 그러므로 자신과 피가 청춘 운다. 자신과 장식하는 보이는 가슴이 피어나기 무엇이 피고 착목한는 사막이다. 되는 내는 목숨을 피어나는 하였으며, 위하여서, 가슴이 구하지 뜨거운지라, 위하여서.',
    views: 23,
    thumbnail: '/images/profile.jpg',
    category: { id: 1, name: '스프링' },
    createdAt: '2022-10-24',
    lastModifiedAt: '2022-10-27',
  },
  {
    id: 2,
    title: '객체지향이란 무엇인가',
    content:
      '풀이 별 북간도에 라이너 밤을 이름과, 소녀들의 언덕 봅니다. 자랑처럼 별 새워 나는 어머니, 풀이 남은 거외다. 말 별을 가을 지나고 밤이 나는 잠, 까닭입니다. 차 별빛이 하늘에는 다 나의 보고, 있습니다. 까닭이요, 없이 남은 까닭입니다. 언덕 하나에 내린 피어나듯이 내 봅니다. 말 밤이 했던 이름을 북간도에 헤일 시와 있습니다. 소녀들의 흙으로 별 가을 이런 보고, 계집애들의 했던 나는 봅니다. 밤을 애기 하나에 부끄러운 사람들의 무성할 덮어 나는 추억과 봅니다. 이제 쉬이 내 별이 하나에 남은 사람들의 봅니다. 속의 가을로 하나의 그리워 딴은 나의 별 까닭입니다. 자랑처럼 벌써 언덕 아름다운 지나가는 겨울이 위에도 버리었습니다. 겨울이 이국 내 새겨지는 쓸쓸함과 이름과, 차 별 노새, 있습니다. 이름을 벌레는 별빛이 하나에 나의 아름다운 부끄러운 까닭입니다. 노새, 별 까닭이요, 봅니다. 봄이 한 그러나 하나 소학교 밤이 까닭이요, 봅니다. 쓸쓸함과 하나 위에 많은 지나고 새겨지는 있습니다. 하나에 한 나는 없이 이름자 버리었습니다. 별 그러나 마리아 다 듯합니다. 청춘이 지나고 그리고 이 시와 당신은 봅니다. 아스라히 딴은 부끄러운 청춘이 어머님, 무성할 위에도 봅니다. 벌레는 릴케 위에 봅니다. 가난한 위에도 나는 아직 당신은 가을 별 버리었습니다. 지나가는 별이 프랑시스 까닭입니다. 피어나듯이 무엇인지 가난한 별 슬퍼하는 위에도 까닭입니다. 위에도 나의 내일 이국 아무 딴은 비둘기, 많은 버리었습니다. 멀리 이름자 않은 같이 별들을 봅니다. 내 이름자를 어머님, 애기 까닭이요, 하나 어머니, 했던 무덤 까닭입니다. 헤일 위에 별 나의 듯합니다. 쓸쓸함과 소녀들의 이름을 언덕 경, 봄이 까닭이요, 당신은 별들을 봅니다. 오면 하나의 이 같이 이름과 버리었습니다.',
    views: 234,
    thumbnail: '/images/profile.jpg',
    category: { id: 3, name: '자바' },
    createdAt: '2022-10-23',
    lastModifiedAt: '2022-10-27',
  },
  {
    id: 3,
    title: 'sql 레벨업',
    content:
      '우리의 이상, 아름답고 천고에 옷을 기관과 자신과 그리하였는가? 때까지 그들의 보이는 것이 붙잡아 그들을 그들의 것이다. 피부가 무한한 창공에 것이다. 대중을 그러므로 자신과 쓸쓸하랴? 이는 뜨거운지라, 갑 때문이다. 두기 인간의 얼마나 충분히 것이다. 바이며, 공자는 방지하는 우리 소담스러운 황금시대다. 품으며, 따뜻한 예가 따뜻한 피다. 보이는 그들은 몸이 이상, 이상 불어 풍부하게 이상의 것이다. 가진 만물은 인간이 구하기 새가 희망의 말이다. 청춘 보배를 피에 몸이 청춘의 크고 것이다. 창공에 든 이는 그들은 황금시대다. 가장 없으면 이상의 피는 발휘하기 봄바람이다. 광야에서 방지하는 뜨거운지라, 같이 사랑의 소리다.이것은 위하여서, 봄바람이다. 그들의 위하여, 풍부하게 때문이다. 천자만홍이 장식하는 우리 든 낙원을 작고 끓는다. 그들은 가치를 이는 위하여서, 충분히 희망의 것이다. 이것은 이것을 보는 원질이 얼음이 사는가 사막이다. 용감하고 갑 내려온 아름다우냐? 없는 역사를 구하지 봄바람이다. 있는 오아이스도 얼마나 싶이 밝은 없으면, 위하여 사랑의 것이다. 못하다 안고, 것은 그것은 끓는다. 청춘이 보이는 새 것이다. 관현악이며, 동력은 무엇을 풀이 것이다.보라, 그들의 구하지 영락과 이것이다. 이상의 기쁘며, 소금이라 군영과 그들의 이상의 청춘의 새 부패뿐이다. 보내는 미묘한 같은 뿐이다. 길을 인간의 따뜻한 위하여 끝까지 칼이다. 피가 웅대한 곳으로 것이다. 목숨을 끓는 기관과 것이다.',

    views: 56,
    thumbnail: '/images/profile.jpg',
    category: { id: 2, name: '데이터' },
    createdAt: '2022-10-22',
    lastModifiedAt: '2022-10-27',
  },
  {
    id: 4,
    title: '분할정복이란 무엇인가?',
    content:
      '이국 하나에 내 무엇인지 패, 우는 있습니다. 남은 다 마리아 위에도 벌레는 계집애들의 거외다. 걱정도 하나에 북간도에 마리아 당신은 파란 벌레는 듯합니다. 시와 가슴속에 써 위에도 이름을 경, 하나의 계십니다. 잠, 너무나 풀이 있습니다. 아침이 많은 어머니, 헤는 봅니다. 별에도 어머니 멀리 책상을 없이 듯합니다. 패, 부끄러운 이런 위에도 듯합니다. 경, 다 가을로 아스라히 이런 하나의 봅니다. 밤을 토끼, 이름자를 딴은 계절이 거외다. 경, 이제 별들을 보고, 사람들의 별 까닭입니다. 자랑처럼 덮어 이름과, 아무 위에 계십니다. 아무 헤일 다 덮어 부끄러운 이름자를 있습니다. 어머님, 잠, 없이 된 애기 멀리 봅니다. 많은 책상을 슬퍼하는 언덕 별을 이름자를 추억과 까닭입니다. 이름자 이런 별 별 노루, 어머니, 하나에 까닭입니다. 밤을 나는 별들을 비둘기, 겨울이 봅니다. 별빛이 말 이제 무엇인지 겨울이 버리었습니다. 멀리 없이 남은 까닭이요, 것은 듯합니다. 지나고 무성할 이름자 하나의 이런 써 못 그러나 있습니다. 어머니, 딴은 하나에 시인의 프랑시스 어머님, 하나에 듯합니다. 별 아침이 하늘에는 어머니, 밤이 슬퍼하는 헤는 새워 아스라히 까닭입니다. 이 이국 했던 차 청춘이 나는 추억과 쉬이 까닭입니다. 별이 하나에 사랑과 헤일 청춘이 벌레는 못 봅니다. 별 옥 소학교 별이 이름자 아침이 봄이 별 이런 까닭입니다. 별 묻힌 별에도 옥 별 어머니, 이름을 쉬이 부끄러운 듯합니다. 다 소녀들의 가슴속에 때 패, 어머니 이네들은 별 별 거외다. 언덕 다 새워 어머님, 것은 있습니다. 별 계집애들의 당신은 시와 옥 책상을 이름을 무성할 봅니다. 다 릴케 딴은 위에 나의 너무나 위에 버리었습니다.',
    views: 83,
    thumbnail: '/images/profile.jpg',
    category: { id: 4, name: '알고리즘' },
    createdAt: '2022-10-31',
    lastModifiedAt: '2022-10-27',
  },
  {
    id: 5,
    title: '다익스트라 알고리즘',
    content:
      '이국 하나에 내 무엇인지 패, 우는 있습니다. 남은 다 마리아 위에도 벌레는 계집애들의 거외다. 걱정도 하나에 북간도에 마리아 당신은 파란 벌레는 듯합니다. 시와 가슴속에 써 위에도 이름을 경, 하나의 계십니다. 잠, 너무나 풀이 있습니다. 아침이 많은 어머니, 헤는 봅니다. 별에도 어머니 멀리 책상을 없이 듯합니다. 패, 부끄러운 이런 위에도 듯합니다. 경, 다 가을로 아스라히 이런 하나의 봅니다. 밤을 토끼, 이름자를 딴은 계절이 거외다. 경, 이제 별들을 보고, 사람들의 별 까닭입니다. 자랑처럼 덮어 이름과, 아무 위에 계십니다. 아무 헤일 다 덮어 부끄러운 이름자를 있습니다. 어머님, 잠, 없이 된 애기 멀리 봅니다. 많은 책상을 슬퍼하는 언덕 별을 이름자를 추억과 까닭입니다. 이름자 이런 별 별 노루, 어머니, 하나에 까닭입니다. 밤을 나는 별들을 비둘기, 겨울이 봅니다. 별빛이 말 이제 무엇인지 겨울이 버리었습니다. 멀리 없이 남은 까닭이요, 것은 듯합니다. 지나고 무성할 이름자 하나의 이런 써 못 그러나 있습니다. 어머니, 딴은 하나에 시인의 프랑시스 어머님, 하나에 듯합니다. 별 아침이 하늘에는 어머니, 밤이 슬퍼하는 헤는 새워 아스라히 까닭입니다. 이 이국 했던 차 청춘이 나는 추억과 쉬이 까닭입니다. 별이 하나에 사랑과 헤일 청춘이 벌레는 못 봅니다. 별 옥 소학교 별이 이름자 아침이 봄이 별 이런 까닭입니다. 별 묻힌 별에도 옥 별 어머니, 이름을 쉬이 부끄러운 듯합니다. 다 소녀들의 가슴속에 때 패, 어머니 이네들은 별 별 거외다. 언덕 다 새워 어머님, 것은 있습니다. 별 계집애들의 당신은 시와 옥 책상을 이름을 무성할 봅니다. 다 릴케 딴은 위에 나의 너무나 위에 버리었습니다.',
    views: 323,
    thumbnail: '/images/profile.jpg',
    category: { id: 4, name: '알고리즘' },
    createdAt: '2022-10-31',
    lastModifiedAt: '2022-10-27',
  },
];
